package org.example.Sem1;
/*
Реализуйте метод, принимающий в качестве аргумента целочисленный двумерный массив.
Необходимо посчитать и вернуть сумму элементов этого массива.
При этом накладываем на метод 2 ограничения: метод может работать только с квадратными массивами
(кол-во строк = кол-ву столбцов), и в каждой ячейке может лежать только значение 0 или 1.
Если нарушается одно из условий, метод должен бросить RuntimeException с сообщением об ошибке.
 */
//public class Task3 {
//    public static void main(String[] args) {
//        Integer[] array = new Integer[]{1, 2, 3, 4};
//        int minimal = 5;
//        System.out.println(CheckArray(array, minimal));
//    }
//    public static Integer CheckArray(Integer[][] array, int min_value){
//        int sum = 0;
//        if (array.length != array[0].length){
//            throw new RuntimeException("Массив не квадратный!");
//        }
//        if (array.length < min_value){
//            return -1;
//        }
//        return min_value;
//    }
//    public Integer[][] CreateArray(int line, int column){
//
//    }
//}
